## Aula 5: Introdução a Banco de Dados + SQL

### Objetivos
Apresentar ao aluno conceitos de banco de dados e DBIs (Database Interface), com enfoque em bancos de dados relacionais e o uso do SQL.

### Habilidades a serem desenvolvidas
Ao fim da aula, o aluno deve saber:
- Conceitos e definições de Banco de Dados, SBGD e Banco de Dados Relacionais;
- Interpretar diagramas do modelo relacional;
- Estruturar e criar um banco de dados;
- Criar tabelas em um banco de dados;
- Obter dados a partir de um banco de dados:
    - Cláusulas `select`, `from`, `where`, `group by`, `having`, `order by`, `join`;
- Enviar dados para um banco de dados.

### Bibliotecas usadas
- Pandas;
- Numpy;
- Matplotlib;
- Seaborn;
- SQLite;
- SQLAlchemy.

### Sugestões de exemplos e exercícios
- Olist.

### Sugestão de leitura
- [Python + MySQL](https://www.w3schools.com/python/python_mysql_getstarted.asp)
- [PEP 249](https://www.python.org/dev/peps/pep-0249/)
- [Database Interfaces, no Python Wiki](https://wiki.python.org/moin/DatabaseInterfaces)

## Códigos

É possível **Inserir** dados na tabela, por exemplo:

    INSERT INTO Usuarios(nome, idade, sexo, salario) VALUES ("Joaquim Silva",60,"M",200)
    
É possível **Atualizar** a tabela, por exemplo: 

    UPDATE Usuarios SET salario=2000 WHERE Nome="Joaquim Silva"
    
É possível **Remover** os dados, por exemplo:

    DELETE FROM Usuarios WHERE Nome="Joaquim Silva"
    
É Possível **Consultar** a tabela, por exemplo :

## Conexao no db4free

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lucas\anaconda3\lib\site-packages (8.0.22)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\lucas\anaconda3\lib\site-packages (from mysql-connector-python) (3.14.0)
Requirement already satisfied: six>=1.9 in c:\users\lucas\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [2]:
import mysql.connector
import pandas as pd

#Dados do banco de dados db4free

host = 'db4free.net'
port = 3306

user = 'lucas_batista'
password = "letscode"
database = "lucas_db_letscod"

In [4]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database, port=port)

cursor = con.cursor()


print(cursor.execute("SHOW TABLES"))

# cursor.close()
con.close()

None

In [7]:
#Conectando
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database, port=port)

sql = '''CREATE TABLE empresas(estabelecimento CHAR(40),
                               receita INT,
                               custo INT,
                               anomes INT)'''

cursor = con.cursor()

cursor.execute('DROP TABLE IF EXISTS empresas')
cursor.execute(sql)

print(cursor.execute("SHOW TABLES"))

con.close()
cursor.description

None

[('Tables_in_lucas_db_letscod', 253, None, None, None, None, 0, 4225)]

In [8]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)

cursor = con.cursor()

sql = "SELECT * FROM empresas"
cursor.execute(sql)
resultado = cursor.fetchall()

desc = cursor.description
cursor.close()
con.close()
print(desc)

[('estabelecimento', 254, None, None, None, None, 1, 0), ('receita', 3, None, None, None, None, 1, 0), ('custo', 3, None, None, None, None, 1, 0), ('anomes', 3, None, None, None, None, 1, 0)]

In [9]:
resultado

[]

### Inserindo dados

Para inserir dados temos que executar uma query atraves de um cursor (uma extrutura de controle), porém a inserção so é salva no banco após enviarmos um commit.

Oberve que ao criamos a query não passamos os valores a serem inseridos diretamente, eles são passados na fução execute, como uma tupla em uma variavel diferente da query. Isto impede o [sql injection](https://pt.wikipedia.org/wiki/Inje%C3%A7%C3%A3o_de_SQL), um tipo comum de ataque por hackers.

#### Inserindo dados

In [10]:
#Abre conexao
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)

val = ("MCDonalds","5000","4000","201912")


sql = f'''INSERT INTO empresas(estabelecimento, receita, custo, anomes) 
VALUES ('{val[0]}','{val[1]}','{val[2]}','{val[3]}')'''

print(sql)

#Define cursor
cursor = con.cursor()
#Executa código SQL
cursor.execute(sql)
#Realiza commit
con.commit()
#Fecha a conexão
con.close()

INSERT INTO empresas(estabelecimento, receita, custo, anomes)
VALUES ('MCDonalds','5000','4000','201912')

#### Checando inserção dos dados

In [18]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)

cursor = con.cursor()

sql = "select * from empresas"
cursor.execute(sql)
resultado = cursor.fetchall()

con.close()
cursor.close()

print(resultado)

[('MCDonalds', 5000, 4000, 201912), ('BurgerKing', 4000, 2800, 201912), ('Wendys', 6000, 4500, 202001), ('Patties', 900, 900, 202001), ('Zebeleo', 5, 10000, 202002), ('Koburger', 3000, 2500, 202002)]

#### Inserindo mais dados

In [12]:
#Abre conexao
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)

val = ("BurgerKing","4000","2800","201912")

sql = f'''INSERT INTO empresas(estabelecimento, receita, custo, anomes) 
VALUES ('{val[0]}','{val[1]}','{val[2]}','{val[3]}')'''

print(sql)

#Define cursor
cursor = con.cursor()
#Executa código SQL
cursor.execute(sql)
#Realiza commit
con.commit()
#Fecha a conexão
con.close()

INSERT INTO empresas(estabelecimento, receita, custo, anomes)
VALUES ('BurgerKing','4000','2800','201912')

In [14]:
resultado

[('MCDonalds', 5000, 4000, 201912), ('BurgerKing', 4000, 2800, 201912)]

## Inserindo vários Dados de uma só vez

In [17]:
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)

cursor = con.cursor()

val =  [("Wendys","6000","4500","202001"),
        ("Patties","900","900","202001"),
        ('Zebeleo', '5', '10000', '202002'),
        ('Koburger', '3000', '2500', '202002')]


sql = '''INSERT INTO empresas(estabelecimento, receita, custo, anomes) 
          VALUES (%s, %s, %s, %s)'''


cursor.executemany(sql, val)
    
con.commit()
con.close()

In [19]:
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

#Query de para buscar todos os usarios
sql = "SELECT * FROM empresas"
cursor.execute(sql)
#Pegando todos os valores retorno
resultado = cursor.fetchall()
#imprimindo item a item
for linha in resultado:
    print("--------------")
    print(linha)
    print("Estabelecimento:",linha[0])
    print("Receita:",linha[1])
    print("Custo:",linha[2])
    print("Anomes:",linha[3])

con.close()

--------------
('MCDonalds', 5000, 4000, 201912)
Estabelecimento: MCDonalds
Receita: 5000
Custo: 4000
Anomes: 201912
--------------
('BurgerKing', 4000, 2800, 201912)
Estabelecimento: BurgerKing
Receita: 4000
Custo: 2800
Anomes: 201912
--------------
('Wendys', 6000, 4500, 202001)
Estabelecimento: Wendys
Receita: 6000
Custo: 4500
Anomes: 202001
--------------
('Patties', 900, 900, 202001)
Estabelecimento: Patties
Receita: 900
Custo: 900
Anomes: 202001
--------------
('Zebeleo', 5, 10000, 202002)
Estabelecimento: Zebeleo
Receita: 5
Custo: 10000
Anomes: 202002
--------------
('Koburger', 3000, 2500, 202002)
Estabelecimento: Koburger
Receita: 3000
Custo: 2500
Anomes: 202002

In [20]:
def select_table(user=user,
                password=password,
                host=host,
                database=database,
                table_name = 'empresas'):
    
    con = mysql.connector.connect(user=user,
                                  password=password,
                                  host=host,
                                  database=database)
    cursor = con.cursor()
    sql = "SELECT * FROM {}".format(table_name)
    
    cursor.execute(sql)
    resultado = cursor.fetchall()
    con.close()
    
    return resultado, cursor

In [21]:
def input_data():
    print('Nome da Empresa :')
    nome = input()
    print('Receita da Empresa :')
    receita = input()
    print('Custo da Empresa :')
    custo = input()
    print('Anomes :')
    anomes = input()
    
    con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                         database=database)
    
    cursor = con.cursor()
    
    
    query = f'''INSERT INTO empresas(estabelecimento,receita, custo, anomes) 
                    VALUES ('{nome.title()}','{receita}','{custo}','{anomes}')'''
    
    cursor.execute(query)
    con.commit()
    con.close()
    return None

**ARGS e KWARGS**

Nesse ponto da aula, vocês haviam sugerido de utilizar o `args` para passar os parâmetros `user`, `password`, etc... na função `input_data` e consequentemente no `mysql.connector.connect`. Acontece que nesse caso, acredito que não seria a melhor forma, pois nós queremos garantir que os parâmetros sejam explicitamente definidos, alem de que utilizando o `args`, teríamos que verificar qual argumento se enquadraría em determinado parâmetro.

Ter conhecimento do que eles fazem é bem válido. Deixo uns links explicando como eles podem ser utilizados e pra que servem:
- https://medium.com/rafaeltardivo/python-entendendo-o-uso-de-args-e-kwargs-em-fun%C3%A7%C3%B5es-e-m%C3%A9todos-c8c2810e9dc8
- https://www.geeksforgeeks.org/args-kwargs-python/
- https://www.programiz.com/python-programming/args-and-kwargs

In [22]:
input_data()

Nome da Empresa :
burguer lab
Receita da Empresa :
1000000
Custo da Empresa :
10000
Anomes :
201912

In [23]:
resultado, cursor = select_table()

In [24]:
resultado

[('MCDonalds', 5000, 4000, 201912),
 ('BurgerKing', 4000, 2800, 201912),
 ('Wendys', 6000, 4500, 202001),
 ('Patties', 900, 900, 202001),
 ('Zebeleo', 5, 10000, 202002),
 ('Koburger', 3000, 2500, 202002),
 ('burguer lab', 1000000, 10000, 201912)]

In [25]:
cursor.description

[('estabelecimento', 254, None, None, None, None, 1, 0),
 ('receita', 3, None, None, None, None, 1, 0),
 ('custo', 3, None, None, None, None, 1, 0),
 ('anomes', 3, None, None, None, None, 1, 0)]

In [27]:
columns = [col[0] for col in cursor.description]
columns

['estabelecimento', 'receita', 'custo', 'anomes']

In [28]:
df_empresas = pd.DataFrame(resultado, columns=columns)

In [29]:
df_empresas.head()

  estabelecimento  receita  custo  anomes
0       MCDonalds     5000   4000  201912
1      BurgerKing     4000   2800  201912
2          Wendys     6000   4500  202001
3         Patties      900    900  202001
4         Zebeleo        5  10000  202002

In [35]:
sql

'SELECT * FROM empresas'

In [37]:
 con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                         database=database)

pd.read_sql_query(sql, con)

  estabelecimento  receita  custo  anomes
0       MCDonalds     5000   4000  201912
1      BurgerKing     4000   2800  201912
2          Wendys     6000   4500  202001
3         Patties      900    900  202001
4         Zebeleo        5  10000  202002
5        Koburger     3000   2500  202002
6     burguer lab  1000000  10000  201912

**Lendo do pandas de forma alternativa**

In [38]:
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

#usando o read_sql_query
df = pd.read_sql_query("SELECT * from empresas", con)

con.close()

In [39]:
df.head()

  estabelecimento  receita  custo  anomes
0       MCDonalds     5000   4000  201912
1      BurgerKing     4000   2800  201912
2          Wendys     6000   4500  202001
3         Patties      900    900  202001
4         Zebeleo        5  10000  202002

Abrir conexao
definir um cursor
Executar a partir do cursor
commitar
fechar conexao

con -> cursor -> cursor.execute() -> con.commit() -> con.close()

In [46]:
con = mysql.connector.connect(user = user, password=password, host=host, database = database)

cursor = con.cursor()

sql = "select estabelecimento from empresas limit 1"

cursor.execute(sql)
resultado = cursor.fetchall()

print(resultado)
con.close()

[('MCDonalds',)]

In [55]:
#Propor exercicio para ler apenas o primeiro nome
#Lendo apenas o nome

con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = "SELECT estabelecimento FROM empresas"
cursor.execute(sql)
resultado = cursor.fetchall()
for linha in resultado:
    print("--------------")
    print(linha[0])
con.close()

--------------
Mequi_1000
--------------
BurgerKing
--------------
Wendys
--------------
Patties
--------------
Zebeleo
--------------
Koburger

### Deletando dados a respeito de uma Tabela

In [52]:
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = "DELETE FROM empresas Where estabelecimento = 'burguer lab'"
cursor.execute(sql)

con.commit()
con.close()

### Atualizando Dados a respeito de uma tabela

In [54]:
con = mysql.connector.connect(user=user,
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = "UPDATE empresas SET estabelecimento = 'Mequi_1000' Where estabelecimento = 'MCDonalds'"
cursor.execute(sql)

con.commit()
con.close()

## Comandos SQL

### Where

In [57]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = '''SELECT *
         FROM empresas
         WHERE receita > 1000'''

cursor.execute(sql)
resultado = cursor.fetchall()
con.close()
print(resultado)

[('Mequi_1000', 5000, 4000, 201912), ('BurgerKing', 4000, 2800, 201912), ('Wendys', 6000, 4500, 202001), ('Koburger', 3000, 2500, 202002)]

In [62]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = '''select SUM(receita) from empresas'''

cursor.execute(sql)
resultado = cursor.fetchall()
con.close()
print(resultado)

[(Decimal('18905'),)]

### Group by

In [64]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = '''SELECT anomes, SUM(receita) as soma_receita
         FROM empresas
         GROUP BY anomes'''

cursor.execute(sql)
resultado = cursor.fetchall()
con.close()
print(resultado)

[(201912, Decimal('9000')), (202001, Decimal('6900')), (202002, Decimal('3005'))]

In [74]:
columns = [res[0] for res in cursor.description]

In [75]:
pd.DataFrame(resultado, columns=columns)

   anomes soma_receita
0  201912         9000
1  202001         6900
2  202002         3005

### Order by

In [77]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = '''SELECT anomes, SUM(receita) as soma_receita
         FROM empresas
         GROUP BY anomes
         ORDER BY anomes DESC'''

cursor.execute(sql)
resultado = cursor.fetchall()
con.close()

pd.DataFrame(resultado, columns=[res[0] for res in cursor.description])

   anomes soma_receita
0  202002         3005
1  202001         6900
2  201912         9000

### Having

In [81]:
con = mysql.connector.connect(user=user, 
                              password=password,
                              host=host,
                              database=database)
cursor = con.cursor()

sql = '''SELECT anomes, SUM(receita) as soma_receita
         FROM empresas
         GROUP BY anomes
         HAVING soma_receita > 6000
         '''

cursor.execute(sql)
resultado = cursor.fetchall()
con.close()

pd.DataFrame(resultado, columns=[res[0] for res in cursor.description])

   anomes soma_receita
0  201912         9000
1  202001         6900

### POSTGRES

In [86]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\lucas\anaconda3\lib\site-packages (2.8.6)

In [84]:
import os
import psycopg2
import psycopg2.extras
import sys
import pandas as pd

def connect_db():
    db_url='lets-coders.cwwx6veimvvm.us-east-1.rds.amazonaws.com'
    db_name='dvd'
    db_user='postgres'
    db_password='letscodeds652'
    
    conn = psycopg2.connect(host=db_url, port = 5432, database=db_name, user=db_user, password=db_password)
    return conn

def execute_query(db, query_string):
    # Create a cursor object
    cur = db.cursor(cursor_factory=psycopg2.extras.DictCursor)
    
    # A sample query of all data from the "vendors" table in the "suppliers" database
    cur.execute(query_string)
    return cur

In [99]:
query = '''
select film.title, category.name as category_name from film 
left join film_category ON film.film_id = film_category.film_id 
left join category ON film_category.category_id = category.category_id
'''

db = connect_db()

cur = execute_query(db, query)

# print(cur.fetchall())

df = pd.DataFrame(cur.fetchall(), columns=[res[0] for res in cur.description])
cur.close()
db.close()
df

                 title category_name
0     Academy Dinosaur   Documentary
1       Ace Goldfinger        Horror
2     Adaptation Holes   Documentary
3     Affair Prejudice        Horror
4          African Egg        Family
..                 ...           ...
995     Young Language   Documentary
996         Youth Kick         Music
997       Zhivago Core        Horror
998  Zoolander Fiction      Children
999          Zorro Ark        Comedy

[1000 rows x 2 columns]

In [101]:
db = connect_db()

df = pd.read_sql_query(query, db)

db.close()
df

                 title category_name
0     Academy Dinosaur   Documentary
1       Ace Goldfinger        Horror
2     Adaptation Holes   Documentary
3     Affair Prejudice        Horror
4          African Egg        Family
..                 ...           ...
995     Young Language   Documentary
996         Youth Kick         Music
997       Zhivago Core        Horror
998  Zoolander Fiction      Children
999          Zorro Ark        Comedy

[1000 rows x 2 columns]